## Importación de librerías

In [33]:
import pandas as pd
import numpy as np
pd.set_option('display.max_columns',None)

#### CARGA DE DATOS CUSTOMER

In [34]:
df_cus = pd.read_excel('../data/raw/customer-details.xlsx')

In [35]:
df_cus

,Unnamed: 0,Income,Kidhome,Teenhome,Dt_Customer,NumWebVisitsMonth,ID
0,0,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079
1,1,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097
2,2,147233,1,1,2012-02-02,5,3f9f49b5-e410-4948-bf6e-f9244f04918b
3,3,121393,1,2,2012-12-21,29,9991fafb-4447-451a-8be2-b0df6098d13e
4,4,63164,1,2,2012-06-20,20,eca60b76-70b6-4077-80ba-bc52e8ebb0eb
...,...,...,...,...,...,...,...
20110,20110,114469,0,2,2012-10-28,13,25f35a3f-0fd2-4e6a-b4d5-74fa1a1f4cfc
20111,20111,82207,0,1,2012-02-10,27,a3d2d088-3781-44ea-9944-a4a40df51285
20112,20112,135009,0,0,2012-09-14,17,3769cb72-26be-40f2-9a93-f752fc96d628
20113,20113,8486,1,1,2012-07-04,18,d507f6b3-a030-46d7-9615-61fe3f6b8028
20114,20114,144419,1,0,2012-04-12,29,8299f0a6-e4c0-49fc-87ab-81308b70f80f

In [36]:
df_cus.sample(5)

,Unnamed: 0,Income,Kidhome,Teenhome,Dt_Customer,NumWebVisitsMonth,ID
16272,16272,109724,1,2,2012-02-14,9,d1b6d799-d750-477d-868e-e0f7136dfd45
6111,6111,135604,2,1,2012-11-03,21,dcbe1391-d093-4dea-b507-3a5806ef103f
7981,7981,21756,0,1,2012-12-28,32,8d5507f4-0e0c-4e99-af05-d6b04bd8e9e5
15237,15237,40593,1,1,2012-01-30,21,062d543d-9c38-4573-9900-74fca06a6019
10061,10061,158569,1,0,2012-02-07,27,4ab31729-9091-4409-b49c-b74c71d99564

In [37]:
# Cargamos el Excel
xls = pd.ExcelFile("../data/raw/customer-details.xlsx")

# Listamos las hojas
print(xls.sheet_names)

['2012', '2013', '2014']

In [38]:
# A continuación, mostramos cada una de las hojas en un DataFrame

df_12 = pd.read_excel(xls, sheet_name=0)   # primera hoja
df_13 = pd.read_excel(xls, sheet_name=1)  # segunda hoja
df_14 = pd.read_excel(xls, sheet_name=2)  # tercera hoja

# Ver un resumen rápido
print("2012:", df_12.shape)
print("2013:", df_13.shape)
print("2014:", df_14.shape)

2012: (20115, 7)
2013: (8965, 7)
2014: (14090, 7)

In [39]:
# Mostramos las tres primeras filas de cada tabla :
print(df_12.head(3))
print(df_13.head(3))
print(df_14.head(3))

   Unnamed: 0  Income  Kidhome  Teenhome Dt_Customer  NumWebVisitsMonth  \
0           0  161770        1         0  2012-04-04                 29
1           1   85477        1         1  2012-12-30                  7
2           2  147233        1         1  2012-02-02                  5

                                     ID
0  089b39d8-e4d0-461b-87d4-814d71e0e079
1  e9d37224-cb6f-4942-98d7-46672963d097
2  3f9f49b5-e410-4948-bf6e-f9244f04918b
   Unnamed: 0  Income  Kidhome  Teenhome Dt_Customer  NumWebVisitsMonth  \
0           0   82407        0         1  2013-10-07                 29
1           1   24877        0         0  2013-04-21                 32
2           2   78839        1         0  2013-11-25                 21

                                     ID
0  ef81336c-e41a-46d0-8a30-5d4ac3b836be
1  50b224ac-84b4-42a7-aba9-3e1d1d620479
2  9cb15c53-b647-464a-add9-09cdae04897c
   Unnamed: 0  Income  Kidhome  Teenhome Dt_Customer  NumWebVisitsMonth  \
0           0  168812        1         1  2014-06-10                 27
1           1  108615        2         1  2014-04-05                 24
2           2  179041        0         2  2014-09-22                  4

                                     ID
0  4d6c811c-0f24-4a73-b374-2ebd1f80d46e
1  eef0f24f-cbdb-4c67-b371-09d7bc59695e
2  bbfdcedd-199d-4927-94bb-5dad051ff471

In [40]:
# Cada hoja pertenece a un año distinto, voy a unir todos los años en un mismo dataframe para hacer el análisis preliminar
df_cus = pd.concat([df_12, df_13, df_14], ignore_index=True)

print("Final:", df_cus.shape)
df_cus.sample(5)

Final: (43170, 7)

,Unnamed: 0,Income,Kidhome,Teenhome,Dt_Customer,NumWebVisitsMonth,ID
27096,6981,145854,2,0,2013-01-10,32,258d0476-386f-4cef-8966-dd8273123d03
28658,8543,149802,1,1,2013-03-19,12,b37b335b-0409-4c28-ad4b-53617f11e9ed
16060,16060,171266,2,0,2012-04-14,20,c08db8c3-9ac2-4a1d-9906-32e5fb04433e
31454,2374,44498,2,1,2014-08-06,19,be849efa-781b-4eac-9af6-baeca18909ef
31133,2053,97342,1,1,2014-11-10,20,ce531125-9e02-422e-bb00-5ee8fac68105

In [41]:
df_cus.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43170 entries, 0 to 43169
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         43170 non-null  int64
 1   Income             43170 non-null  int64
 2   Kidhome            43170 non-null  int64
 3   Teenhome           43170 non-null  int64
 4   Dt_Customer        43170 non-null  datetime64[ns]
 5   NumWebVisitsMonth  43170 non-null  int64
 6   ID                 43170 non-null  object
dtypes: datetime64[ns](1), int64(5), object(1)
memory usage: 2.3+ MB

Esta todo con el formato correcto.

#### Análisis preliminar

Analizando los datos, podemos ver como la columna Unnamed: 0, no aporta ningún valor, y que por ello puede ser eliminada. Además, habría que revisar si en la columna de ID hay algún valor repetido, ya que en el caso del ID debería de ser único para cada cliente.

In [45]:
df_cus.isna().sum()

Unnamed: 0           0
Income               0
Kidhome              0
Teenhome             0
Dt_Customer          0
NumWebVisitsMonth    0
ID                   0
dtype: int64

In [46]:
#Visualizamos si hay duplicados en la tabla
df_cus.duplicated().sum()

np.int64(0)

In [47]:
# Mirar si hay dublicados en la columan de ID:
df_cus['ID'].duplicated().sum()

np.int64(0)

Podemos observar como en la tabla no existen ningñun duplicado.

In [50]:
df_cus.describe()

,Unnamed: 0,Income,Kidhome,Teenhome,Dt_Customer,NumWebVisitsMonth
count,43170.000000,43170.000000,43170.000000,43170.000000,43170,43170.000000
mean,7916.022469,93227.389622,1.004749,0.998633,2013-05-11 22:09:47.407922176,16.591290
min,0.000000,5841.000000,0.000000,0.000000,2012-01-01 00:00:00,1.000000
25%,3597.000000,49608.000000,0.000000,0.000000,2012-07-16 00:00:00,9.000000
50%,7194.500000,93009.500000,1.000000,1.000000,2013-03-01 00:00:00,17.000000
75%,11705.750000,136740.500000,2.000000,2.000000,2014-03-28 00:00:00,25.000000
max,20114.000000,180802.000000,2.000000,2.000000,2014-12-31 00:00:00,32.000000
std,5228.248885,50498.181989,0.815996,0.816008,NaN,9.241769

### Columnas del Dataset
- ``income``: Representa el ingreso anual del cliente en términos monetarios.  
- ``kidhome``: Indica el número de niños en el hogar del cliente.  
- ``teenhome``: Indica el número de adolescentes en el hogar del cliente.  
- ``dt_customer``: Representa la fecha en que el cliente se convirtió en cliente de la empresa.  
- ``numwebvisitsmonth``: Indica la cantidad de visitas mensuales del cliente al sitio web de la empresa.  
- ``id``: Identificador único del cliente.

### Resumen del análisis
- **Ingreso anual (`income`)**:  
  - valores entre 5.841 y 180.802.  
  - media de 93.227, mediana de 93.010.  
  - distribución razonable para representar ingresos anuales.  
- **Número de niños (`kidhome`)**: valores de 0 a 2.  
- **Número de adolescentes (`teenhome`)**: valores de 0 a 2.  
- **Número de visitas web mensuales (`numwebvisitsmonth`)**:  
  - valores entre 1 y 32.  
  - media de 16, mediana de 17.  
- **Fecha de alta (`dt_customer`)**:  
  - rango comprendido entre enero de 2012 y diciembre de 2014.  
  - permite analizar la antigüedad de los clientes.

In [51]:
# Eliminamos la columna Unnamed: 0
df_cus = df_cus.drop(columns=["Unnamed: 0"])
df_cus.head()

,Income,Kidhome,Teenhome,Dt_Customer,NumWebVisitsMonth,ID
0,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079
1,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097
2,147233,1,1,2012-02-02,5,3f9f49b5-e410-4948-bf6e-f9244f04918b
3,121393,1,2,2012-12-21,29,9991fafb-4447-451a-8be2-b0df6098d13e
4,63164,1,2,2012-06-20,20,eca60b76-70b6-4077-80ba-bc52e8ebb0eb

In [54]:
df_cus.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43170 entries, 0 to 43169
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Income             43170 non-null  int64
 1   Kidhome            43170 non-null  int64
 2   Teenhome           43170 non-null  int64
 3   Dt_Customer        43170 non-null  datetime64[ns]
 4   NumWebVisitsMonth  43170 non-null  int64
 5   ID                 43170 non-null  object
dtypes: datetime64[ns](1), int64(4), object(1)
memory usage: 2.0+ MB

In [56]:
# Guardamos los datos limpios

df_cus.to_csv("../data/processed/customer-details_clean.xlsx", index=False)